"use strict";
var __areaData__ = {
    "provinces": ["云南", "湖北", "河南", "四川", "青海", "台湾", "辽宁", "山西", "浙江", "广西", "吉林", "陕西", "内蒙古", "宁夏", "福建", "河北", "江西", "重庆", "黑龙江", "甘肃", "北京", "香港", "湖南", "安徽", "山东", "天津", "贵州", "广东", "上海", "西藏", "海南", "新疆", "江苏", "澳门"],
    "北京": {
        "citys": ["北京"],
        "北京": {"areas": ["丰台区", "海淀区", "宣武区", "门头沟区", "大兴区", "通州区", "平谷区", "朝阳区", "崇文区", "顺义区", "昌平区", "怀柔区", "石景山区", "延庆县", "密云县", "房山区", "西城区", "东城区"]}
    },
    "天津": {
        "citys": ["天津"],
        "天津": {"areas": ["北辰区", "南开区", "红桥区", "塘沽区", "静海县", "汉沽区", "宝坻区", "西青区", "河北区", "津南区", "河西区", "大港区", "河东区", "宁河县", "东丽区", "蓟  县", "武清区", "和平区"]}
    },
    "河北": {
        "citys": ["石家庄", "唐山", "秦皇岛", "邯郸", "邢台", "保定", "张家口", "承德", "沧州", "廊坊", "衡水"],
        "石家庄": {"areas": ["桥西区", "赞皇县", "井陉矿区", "元氏县", "无极县", "赵  县", "藁", "高邑县", "正定县", "深泽县", "鹿泉市", "平山县", "辛集市", "灵寿县", "长安区", "晋州市", "郊  区", "新华区", "行唐县", "栾城县", "新乐市", "井陉县", "桥东区"]},
        "唐山": {"areas": ["迁西县", "玉田县", "开平区", "迁安市", "古冶区", "路南区", "新  区", "遵化市", "路北区", "滦南县", "乐亭县", "滦  县", "唐海县", "丰润县", "丰南市"]},
        "秦皇岛": {"areas": ["昌黎县", "北戴河区", "山海关区", "卢龙县", "海港区", "抚宁县", "青龙满族自治县"]},
        "邯郸": {"areas": ["邱  县", "馆陶县", "永年县", "大名县", "魏  县", "武安市", "肥乡县", "邯郸县", "成安县", "邯山区", "复兴区", "曲周县", "丛台区", "广平县", "鸡泽县", "峰峰矿区", "磁  县", "涉  县", "临漳县"]},
        "邢台": {"areas": ["桥西区", "巨鹿县", "威  县", "隆尧县", "广宗县", "宁晋县", "临城县", "平乡县", "清河县", "内丘县", "邢台县", "南宫市", "任  县", "南和县", "临西县", "沙河市", "新河县", "柏乡县", "桥东区"]},
        "保定": {"areas": ["曲阳县", "徐水县", "高阳县", "南市区", "博野", "安新县", "清苑县", "望都县", "蠡  县", "北市区", "易  县", "涞水县", "唐  县", "顺平县", "安国市", "雄县", "容城县", "定州市", "涞源县", "涿州市", "阜平县", "定兴县", "新市区", "满城县", "高碑店市"]},
        "张家口": {"areas": ["尚义县", "下花园区", "怀来县", "蔚  县", "张北县", "怀安县", "涿鹿县", "沽源县", "万全县", "赤城县", "康保县", "宣化区", "崇礼县", "宣化县", "阳原县", "桥东区", "桥西区"]},
        "承德": {"areas": ["宽城满族自治县", "双滦区", "围场满族蒙古族自治县", "兴隆县", "隆化县", "承德县", "丰宁满族自治县", "平泉县", "滦平县", "双桥区", "鹰手营子矿区"]},
        "沧州": {"areas": ["青  县", "河间市", "孟村回族自治县", "东光县", "沧  县", "献  县", "海兴县", "南皮县", "黄骅市", "盐山县", "任丘市", "运河区", "肃宁县", "新华区", "吴桥县", "泊头市"]},
        "廊坊": {"areas": ["大城县", "固安县", "香河县", "永清县", "文安县", "霸州市", "三河市", "大厂回族自治县", "安次区"]},
        "衡水": {"areas": ["安平县", "武强县", "武邑县", "枣强县", "饶阳县", "冀州市", "阜城县", "故城县", "深州市", "桃城区", "景  县"]}
    },
    "山西": {
        "citys": ["太原", "大同", "阳泉", "长治", "晋城", "朔州", "忻州", "吕梁", "晋中", "临汾", "运城"],
        "太原": {"areas": ["古交市", "杏花岭区", "万柏林区", "娄烦县", "晋源区", "清徐县", "迎泽区", "小店区", "尖草坪区", "阳曲县"]},
        "大同": {"areas": ["新荣区", "矿  区", "城  区", "阳高县", "灵丘县", "大同县", "左云县", "天镇县", "浑源县", "广灵县", "南郊区"]},
        "阳泉": {"areas": ["矿  区", "郊  区", "盂  县", "平定县", "城  区"]},
        "长治": {"areas": ["郊  区", "城  区", "黎城县", "平顺县", "长治县", "沁  县", "武乡县", "襄垣县", "潞城市", "长子县", "沁源县", "屯留县", "壶关县"]},
        "晋城": {"areas": ["阳城县", "泽州县", "陵川县", "沁水县", "高平市", "城  区"]},
        "朔州": {"areas": ["平鲁区", "怀仁县", "应  县", "右玉县", "朔城区", "山阴县"]},
        "忻州": {"areas": ["岢岚县", "保德县", "神池县", "静乐县", "定襄县", "原平市", "五台县", "繁峙县", "五寨县", "偏关县", "河曲县", "代  县", "忻府区", "宁武县"]},
        "吕梁": {"areas": ["孝义市", "中阳县", "临  县", "汾阳市", "离石区", "交城县", "石楼县", "兴  县", "交口县", "岚  县", "柳林县", "方山县", "文水县"]},
        "晋中": {"areas": ["寿阳县", "灵石县", "榆次市", "太谷县", "榆社县", "左权县", "平遥县", "介休市", "昔阳县", "和顺县", "祁  县"]},
        "临汾": {"areas": ["翼城县", "曲沃县", "侯马市", "永和县", "浮山县", "大宁县", "吉  县", "洪洞县", "霍州市", "襄汾县", "隰  县", "蒲  县", "临汾市", "汾西县", "乡宁县", "安泽县", "古  县"]},
        "运城": {"areas": ["万荣县", "稷山县", "芮城县", "临猗县", "垣曲县", "新绛县", "夏  县", "平陆县", "绛  县", "闻喜县", "运城市", "河津市", "永济市"]}
    },
    "内蒙古": {
        "citys": ["呼和浩特", "包头", "乌海", "赤峰", "呼伦贝尔", "兴安盟", "通辽", "锡林郭勒盟", "乌兰察布盟", "伊克昭盟", "巴彦淖尔盟", "阿拉善盟"],
        "呼和浩特": {"areas": ["郊  区", "和林格尔县", "托克托县", "新城区", "土默特左旗", "玉泉区", "武川县", "回民区", "清水河县"]},
        "包头": {"areas": ["白云矿区", "郊  区", "青山区", "固阳县", "东河区", "昆都伦区", "土默特右旗", "达尔罕茂明安联合旗", "石拐矿区"]},
        "乌海": {"areas": ["乌达区", "海南区", "海勃湾区"]},
        "赤峰": {"areas": ["敖汉旗", "红山区", "松山区", "元宝山区", "宁城县", "阿鲁科尔沁旗", "巴林右旗", "巴林左旗", "翁牛特旗", "林西县", "喀喇沁旗", "克什克腾旗"]},
        "呼伦贝尔": {"areas": ["新巴尔虎左旗", "莫力达瓦达斡尔族自治旗", "海拉尔市", "鄂温克族自治旗", "额尔古纳市", "陈巴尔虎旗", "满洲里市", "根河市", "扎兰屯市", "牙克石市", "新巴尔虎右旗", "鄂伦春自治旗", "阿荣旗"]},
        "兴安盟": {"areas": ["阿尔山市", "扎赉特旗", "突泉县", "科尔沁右翼前旗", "科尔沁右翼中旗", "乌兰浩特市"]},
        "通辽": {"areas": ["开鲁县", "奈曼旗", "科尔沁区", "霍林郭勒市", "扎鲁特旗", "库伦旗", "科尔沁左翼后旗", "科尔沁左翼中旗"]},
        "锡林郭勒盟": {"areas": ["苏尼特左旗", "苏尼特右旗", "二连浩特市", "镶黄旗", "阿巴嘎旗", "锡林浩特市", "东乌珠穆沁旗", "多伦县", "正蓝旗", "西乌珠穆沁旗", "太仆寺旗", "正镶白旗"]},
        "乌兰察布盟": {"areas": ["察哈尔右翼后旗", "集宁市", "卓资县", "商都县", "察哈尔右翼前旗", "四子王旗", "化德县", "凉城县", "察哈尔右翼中旗", "兴和县", "丰镇市"]},
        "伊克昭盟": {"areas": ["东胜市", "达拉特旗", "杭锦旗", "鄂托克旗", "鄂托克前旗", "准格尔旗", "伊金霍洛旗", "乌审旗"]},
        "巴彦淖尔盟": {"areas": ["五原县", "乌拉特后旗", "乌拉特中旗", "临河市", "杭锦后旗", "乌拉特前旗", "磴口县"]},
        "阿拉善盟": {"areas": ["额济纳旗", "阿拉善左旗", "阿拉善右旗"]}
    },
    "辽宁": {
        "citys": ["沈阳", "大连", "鞍山", "抚顺", "本溪", "丹东", "锦州", "营口", "阜新", "辽阳", "盘锦", "铁岭", "朝阳", "葫芦岛"],
        "沈阳": {"areas": ["苏家屯区", "铁西区", "沈河区", "于洪区", "新民市", "法库县", "大东区", "东陵区", "辽中县", "和平区", "新城子区", "康平县", "皇姑区"]},
        "大连": {"areas": ["旅顺口区", "西岗区", "庄河市", "金州区", "普兰店市", "沙河口区", "中山区", "长海县", "甘井子区", "瓦房店市"]},
        "鞍山": {"areas": ["岫岩满族自治县", "铁东区", "铁西区", "立山区", "海城市", "台安县", "千山区"]},
        "抚顺": {"areas": ["顺城区", "新宾满族自治县", "清原满族自治县", "望花区", "新抚区", "抚顺县", "东洲区"]},
        "本溪": {"areas": ["桓仁满族自治县", "平山区", "溪湖区", "南芬区", "本溪满族自治县", "明���区"]},
        "丹东": {"areas": ["振安区", "元宝区", "宽甸满族自治县", "凤城市", "东港市", "振兴区"]},
        "锦州": {"areas": ["义县", "黑山县", "凌海市", "古塔区", "北宁市", "凌河区", "太和区"]},
        "营口": {"areas": ["盖州市", "老边区", "大石桥市", "站前区", "西市区", "鲅鱼圈区"]},
        "阜新": {"areas": ["太平区", "彰武县", "清河门区", "新邱区", "海州区", "阜新蒙古族自治县", "细河区"]},
        "辽阳": {"areas": ["辽阳县", "白塔区", "灯塔市", "弓长岭区", "太子河区", "宏伟区", "文圣区"]},
        "盘锦": {"areas": ["盘山县", "兴隆台区", "双台子区", "大洼县"]},
        "铁岭": {"areas": ["铁岭县", "清河区", "西丰县", "银州区", "昌图县", "开原市", "调兵山市"]},
        "朝阳": {"areas": ["朝阳县", "双塔区", "喀喇沁左翼蒙古族自治县", "凌源市", "龙城区", "建平县", "北票市"]},
        "葫芦岛": {"areas": ["连山区", "龙港区", "绥中县", "南票区", "兴城市", "建昌县"]}
    },
    "吉林": {
        "citys": ["长春", "吉林", "四平", "辽源", "通化", "白山", "松原", "白城", "延边朝鲜族自治州"],
        "长春": {"areas": ["九台市", "二道区", "宽城区", "双阳区", "德惠市", "榆树市", "绿园区", "农安县", "朝阳区", "南关区"]},
        "吉林": {"areas": ["丰满区", "船营区", "龙潭区", "磐石市", "桦甸市", "舒兰市", "蛟河市", "永吉县", "昌邑区"]},
        "四平": {"areas": ["梨树县", "公主岭市", "铁东区", "铁西区", "伊通满族自治县", "双辽市"]},
        "辽源": {"areas": ["龙山区", "东辽县", "东丰县", "西安区"]},
        "通化": {"areas": ["通化县", "集安市", "二道江区", "梅河口市", "东昌区", "柳河县", "辉南县"]},
        "白山": {"areas": ["临江市", "长白朝鲜族自治县", "抚松县", "八道江区", "江源区", "靖宇县"]},
        "松原": {"areas": ["宁江区", "长岭县", "前郭尔罗斯蒙古族自治县", "扶余县", "乾安县"]},
        "白城": {"areas": ["大安市", "通榆县", "洮北区", "镇赉县", "洮南市"]},
        "延边朝鲜族自治州": {"areas": ["汪清县", "图们市", "珲春市", "安图县", "和龙市", "延吉市", "龙井市", "敦化市"]}
    },
    "黑龙江": {
        "citys": ["哈尔滨", "齐齐哈尔", "鹤岗", "双鸭山", "鸡西", "大庆", "伊春", "牡丹江", "佳木斯", "七台河", "黑河", "绥化", "大兴安岭地区"],
        "哈尔滨": {"areas": ["五常市", "双城市", "道里区", "平房区", "通河县", "方正县", "木兰县", "香坊区", "延寿县", "道外区", "呼兰区", "依兰县", "巴彦县", "阿城区", "松北区", "宾县", "南岗区", "尚志市"]},
        "齐齐哈尔": {"areas": ["讷河市", "泰来县", "依安县", "梅里斯达斡尔族区", "龙沙区", "克山县", "富拉尔基区", "昂昂溪区", "克东县", "拜泉县", "龙江县", "甘南县", "建华区", "铁锋区", "富裕县", "碾子山区"]},
        "鹤岗": {"areas": ["南山区", "绥滨县", "东山区", "兴安区", "工农区", "兴山区", "萝北县", "向阳区"]},
        "双鸭山": {"areas": ["岭东区", "尖山区", "友谊县", "宝清县", "集贤县", "四方台区", "饶河县", "宝山区"]},
        "鸡西": {"areas": ["梨树区", "鸡冠区", "麻山区", "虎林市", "恒山区", "密山市", "滴道区", "鸡东县", "城子河区"]},
        "大庆": {"areas": ["肇源县", "龙凤区", "杜尔伯特蒙古族自治县", "让胡路区", "肇州县", "萨尔图区", "红岗区", "大同区", "林甸县"]},
        "伊春": {"areas": ["金山屯区", "伊春区", "带岭区", "上甘岭区", "五营区", "南岔区", "乌马河区", "翠峦区", "西林区", "乌伊岭区", "美溪区", "嘉荫县", "新青区", "友好区", "红星区", "铁力市", "汤旺河区"]},
        "牡丹江": {"areas": ["林口县", "东宁县", "穆棱市", "海林市", "爱民区", "西安区", "阳明区", "东安区", "宁安市", "绥芬河市"]},
        "佳木斯": {"areas": ["汤原县", "郊区", "富锦市", "同江市", "东风区", "抚远县", "桦南县", "桦川县", "前进区", "向阳区"]},
        "七台河": {"areas": ["新兴区", "茄子河区", "桃山区", "勃利县"]},
        "黑河": {"areas": ["五大连池市", "爱辉区", "孙吴县", "逊克县", "北安市", "嫩江县"]},
        "绥化": {"areas": ["庆安县", "海伦市", "北林区", "望奎县", "明水县", "青冈县", "肇东市", "兰西县", "绥棱县", "安达市"]},
        "大兴安岭地区": {"areas": ["塔河县", "大兴安岭辖区", "呼玛县", "漠河县"]}
    },
    "上海": {
        "citys": ["上海"],
        "上海": {"areas": ["金山区", "卢湾区", "虹口区", "崇明县", "闵行区", "长宁区", "徐汇区", "青浦区", "杨浦区", "黄浦区", "浦东新区", "奉贤区", "静安区", "宝山区", "闸北区", "南汇区", "嘉定区", "普陀区", "松江区"]}
    },
    "江苏": {
        "citys": ["南京", "苏州", "无锡", "常州", "镇江", "南通", "泰州", "扬州", "盐城", "连云港", "徐州", "淮安", "宿迁"],
        "南京": {"areas": ["浦口区", "六合区", "溧水县", "鼓楼区", "白下区", "秦淮区", "江宁区", "建邺区", "下关区", "高淳县", "雨花台区", "栖霞区", "玄武区"]},
        "苏州": {"areas": ["昆山市", "虎丘区", "张家港市", "常熟市", "沧浪区", "平江区", "吴中区", "太仓市", "吴江市", "金阊区", "相城区"]},
        "无锡": {"areas": ["宜兴市", "锡山区", "滨湖区", "南长区", "江阴市", "惠山区", "崇安区", "北塘区"]},
        "常州": {"areas": ["新北区", "金坛市", "戚墅堰区", "天宁区", "钟楼区", "溧阳市", "武进区"]},
        "镇江": {"areas": ["丹徒区", "润州区", "丹阳市", "句容市", "京口区", "扬中市"]},
        "南通": {"areas": ["启东市", "海安县", "通州市", "港闸区", "如东县", "海门市", "如皋市", "崇川区"]},
        "泰州": {"areas": ["海陵区", "姜堰市", "靖江市", "高港区", "兴化市", "泰兴市"]},
        "扬州": {"areas": ["邗江区", "宝应县", "仪征市", "高邮市", "江都市", "维扬区", "广陵区"]},
        "盐城": {"areas": ["亭湖区", "滨海县", "东台市", "阜宁县", "射阳县", "大丰市", "响水县", "盐都区", "建湖县"]},
        "连云港": {"areas": ["新浦区", "连云区", "灌南县", "海州区", "赣榆县", "灌云县", "东海县"]},
        "徐州": {"areas": ["睢宁县", "贾汪区", "新沂市", "铜山县", "邳州市", "丰县", "鼓楼区", "泉山区", "云龙区", "沛县", "九里区"]},
        "淮安": {"areas": ["楚州区", "涟水县", "清河区", "淮阴区", "金湖县", "洪泽县", "盱眙县", "清浦区"]},
        "宿迁": {"areas": ["沭阳县", "宿城区", "泗阳县", "泗洪县", "宿豫区"]}
    },
    "浙江": {
        "citys": ["杭州", "宁波", "温州", "嘉兴", "湖州", "绍兴", "金华", "衢州", "舟山", "台州", "丽水"],
        "杭州": {"areas": ["上城区", "下城区", "桐庐县", "萧山区", "江干区", "西湖区", "淳安县", "滨江区", "富阳市", "建德市", "拱墅区", "余杭区", "临安市"]},
        "宁波": {"areas": ["慈溪市", "江北区", "江东区", "北仑区", "奉化市", "宁海县", "余姚市", "象山县", "海曙区", "鄞州区", "镇海区"]},
        "温州": {"areas": ["文成县", "乐清市", "平阳县", "永嘉县", "苍南县", "泰顺县", "瑞安市", "鹿城区", "龙湾区", "瓯海区", "洞头县"]},
        "嘉兴": {"areas": ["嘉善县", "桐乡市", "秀城区", "秀洲区", "海盐县", "海宁市", "平湖市"]},
        "湖州": {"areas": ["长兴县", "德清县", "南浔区", "吴兴区", "安吉县"]},
        "绍兴": {"areas": ["新昌县", "越城区", "绍兴县", "上虞市", "诸暨市", "嵊州市"]},
        "金华": {"areas": ["武义县", "磐安县", "义乌市", "金东区", "永康市", "东阳市", "兰溪市", "婺城区", "浦江县"]},
        "衢州": {"areas": ["龙游县", "开化县", "江山市", "柯城区", "常山县", "衢江区"]},
        "舟山": {"areas": ["岱山县", "普陀区", "定海区", "嵊泗县"]},
        "台州": {"areas": ["天台县", "路桥区", "椒江区", "仙居县", "温岭市", "三门县", "黄岩区", "临海市", "玉环县"]},
        "丽水": {"areas": ["松阳县", "青田县", "遂昌县", "庆元县", "景宁畲族自治县", "云和县", "龙泉市", "莲都区", "缙云县"]}
    },
    "安徽": {
        "citys": ["合肥", "芜湖", "蚌埠", "淮南", "马鞍山", "淮北", "铜陵", "安庆", "黄山", "滁州", "阜阳", "宿州", "巢湖", "六安", "亳州", "池州", "宣城"],
        "合肥": {"areas": ["长丰县", "肥东县", "蜀山区", "庐阳区", "包河区", "肥西县", "瑶海区"]},
        "芜湖": {"areas": ["三山区", "弋江区", "南陵县", "芜湖县", "繁昌县", "鸠江区", "镜湖区"]},
        "蚌埠": {"areas": ["龙子湖区", "五河县", "淮上区", "蚌山��", "固镇县", "禹会区", "怀远县"]},
        "淮南": {"areas": ["大通区", "潘集区", "凤台县", "八公山区", "田家庵区", "谢家集区"]},
        "马鞍山": {"areas": ["当涂县", "雨山区", "花山区", "金家庄区"]},
        "淮北": {"areas": ["濉溪县", "烈山区", "杜集区", "相山区"]},
        "铜陵": {"areas": ["铜官山区", "狮子山区", "郊区", "铜陵县"]},
        "安庆": {"areas": ["桐城市", "望江县", "太湖县", "大观区", "岳西县", "怀宁县", "枞阳县", "潜山县", "迎江区", "宿松县", "宜秀区"]},
        "黄山": {"areas": ["黄山区", "祁门县", "休宁县", "黟县", "歙县", "徽州区", "屯溪区"]},
        "滁州": {"areas": ["全椒县", "定远县", "凤阳县", "天长市", "南谯区", "明光市", "来安县", "琅琊区"]},
        "阜阳": {"areas": ["颍上县", "界首市", "临泉县", "颍东区", "颍泉区", "颍州区", "太和县", "阜南县"]},
        "宿州": {"areas": ["灵璧县", "埇桥区", "砀山县", "泗县", "萧县"]},
        "巢湖": {"areas": ["含山县", "庐江县", "和县", "居巢区", "无为县"]},
        "六安": {"areas": ["霍山县", "寿县", "金安区", "裕安区", "霍邱县", "金寨县", "舒城县"]},
        "亳州": {"areas": ["蒙城县", "涡阳县", "利辛县", "谯城区"]},
        "池州": {"areas": ["贵池区", "石台县", "青阳县", "东至县"]},
        "宣城": {"areas": ["宁国市", "泾县", "旌德县", "绩溪县", "广德县", "宣州区", "郎溪县"]}
    },
    "福建": {
        "citys": ["福州", "厦门", "莆田", "三明", "泉州", "漳州", "南平", "龙岩", "宁德"],
        "福州": {"areas": ["连江县", "闽侯县", "闽清县", "仓山区", "马尾区", "台江区", "长乐市", "福清市", "鼓楼区", "永泰县", "晋安区", "平潭县", "罗源县"]},
        "厦门": {"areas": ["同安区", "集美区", "海沧区", "翔安区", "思明区", "湖里区"]},
        "莆田": {"areas": ["涵江区", "秀屿区", "仙游县", "荔城区", "城厢区"]},
        "三明": {"areas": ["建宁县", "尤溪县", "明溪县", "清流县", "梅列区", "宁化县", "将乐县", "泰宁县", "永安市", "三元区", "沙县", "大田县"]},
        "泉州": {"areas": ["晋江市", "惠安县", "南安市", "石狮市", "德化县", "安溪县", "金门县", "泉港区", "鲤城区", "永春县", "丰泽区", "洛江区"]},
        "漳州": {"areas": ["长泰县", "龙海市", "南靖县", "龙文区", "诏安县", "漳浦县", "云霄县", "平和县", "华安县", "东山县", "芗城区"]},
        "南平": {"areas": ["政和县", "顺昌县", "建瓯市", "浦城县", "松溪县", "光泽县", "延平区", "建阳市", "邵武市", "武夷山市"]},
        "龙岩": {"areas": ["上杭县", "漳平市", "新罗区", "永定县", "长汀县", "连城县", "武平县"]},
        "宁德": {"areas": ["周宁县", "福鼎市", "霞浦县", "古田县", "蕉城区", "屏南县", "柘荣县", "福安市", "寿宁县"]}
    },
    "江西": {
        "citys": ["南昌", "景德镇", "萍乡", "九江", "新余", "鹰潭", "赣州", "吉安", "宜春", "抚州", "上饶"],
        "南昌": {"areas": ["东湖区", "南昌县", "青云谱区", "进贤县", "安义县", "西湖区", "青山湖区", "新建县", "湾里区"]},
        "景德镇": {"areas": ["珠山区", "乐平市", "浮梁县", "昌江区"]},
        "萍乡": {"areas": ["湘东区", "安源区", "上栗县", "莲花县", "芦溪县"]},
        "九江": {"areas": ["修水县", "庐山区", "德安县", "都昌县", "永修县", "瑞昌市", "九江县", "武宁县", "彭泽县", "浔阳区", "湖口县", "星子县"]},
        "新余": {"areas": ["分宜县", "渝水区"]},
        "鹰潭": {"areas": ["月湖区", "贵溪市", "余江县"]},
        "赣州": {"areas": ["大余县", "赣县", "会昌县", "定南县", "信丰县", "寻乌县", "龙南县", "章贡区", "南康市", "上犹县", "于都县", "瑞金市", "宁都县", "安远县", "石城县", "全南县", "兴国县", "崇义县"]},
        "吉安": {"areas": ["遂川县", "安福县", "吉安县", "万安县", "永新县", "永丰县", "泰和县", "吉州区", "峡江县", "井冈山市", "青原区", "新干县", "吉水县"]},
        "宜春": {"areas": ["靖安县", "樟树市", "宜丰县", "袁州区", "万载县", "丰城市", "高安市", "上高县", "铜鼓县", "奉新县"]},
        "抚州": {"areas": ["资溪县", "广昌县", "临川区", "金溪县", "东乡县", "崇仁县", "南丰县", "乐安县", "南城县", "宜黄县", "黎川县"]},
        "上饶": {"areas": ["万年县", "玉山县", "横峰县", "铅山县", "鄱阳县", "余干县", "广丰县", "德兴市", "弋阳县", "信州区", "婺源县", "上饶县"]}
    },
    "山东": {
        "citys": ["济南", "青岛", "淄博", "枣庄", "东营", "烟台", "潍坊", "济宁", "泰安", "威海", "日照", "莱芜", "临沂", "德州", "聊城", "滨州", "菏泽"],
        "济南": {"areas": ["天桥区", "平阴县", "济阳县", "长清区", "槐荫区", "商河县", "章丘市", "市中区", "历城区", "历下区"]},
        "青岛": {"areas": ["四方区", "平度市", "李沧区", "市北区", "莱西市", "胶南市", "市南区", "崂山区", "城阳区", "即墨市", "胶州市", "黄岛区"]},
        "淄博": {"areas": ["张店区", "沂源县", "淄川区", "临淄区", "桓台县", "周村区", "高青县", "博山区"]},
        "枣庄": {"areas": ["市中区", "台儿庄区", "薛城区", "滕州市", "峄城区", "山亭区"]},
        "东营": {"areas": ["利津县", "垦利县", "河口区", "广饶县", "东营区"]},
        "烟台": {"areas": ["牟平区", "蓬莱市", "福山区", "芝罘区", "龙口市", "海阳市", "莱阳市", "招远市", "长岛县", "莱山区", "莱州市", "栖霞市"]},
        "潍坊": {"areas": ["青州市", "高密市", "寒亭区", "寿光市", "临朐县", "坊子区", "安丘市", "诸城市", "潍城区", "昌乐县", "奎文区", "昌邑市"]},
        "济宁": {"areas": ["汶上县", "微山县", "梁山县", "任城区", "泗水县", "邹城市", "鱼台县", "市中区", "兖州市", "曲阜市", "金乡县", "嘉祥县"]},
        "泰安": {"areas": ["宁阳县", "岱岳区", "新泰市", "东平县", "肥城市", "泰山区"]},
        "威海": {"areas": ["环翠区", "乳山市", "荣成市", "文登市"]},
        "日照": {"areas": ["五莲县", "岚山区", "东港区", "莒县"]},
        "莱芜": {"areas": ["莱城区", "钢城区"]},
        "临沂": {"areas": ["沂水县", "沂南县", "临沭县", "苍山县", "河东区", "蒙阴县", "莒南县", "兰山区", "罗庄区", "郯城县", "费县", "平邑县"]},
        "德州": {"areas": ["夏津县", "德城区", "陵县", "宁津县", "武城县", "庆云县", "齐河县", "乐陵市", "临邑县", "禹城市", "平原县"]},
        "聊城": {"areas": ["东阿县", "茌平县", "莘县", "冠县", "阳谷县", "临清市", "高唐县", "东昌府区"]},
        "滨州": {"areas": ["邹平县", "惠民县", "沾化县", "无棣县", "阳信县", "博兴县", "滨城区"]},
        "菏泽": {"areas": ["定陶县", "东明县", "巨野县", "牡丹区", "单县", "成武县", "郓城县", "鄄城县", "曹县"]}
    },
    "河南": {
        "citys": ["郑州", "开封", "洛阳", "平顶山", "安阳", "鹤壁", "新乡", "焦作", "濮阳", "许昌", "漯河", "三门峡", "南阳", "商丘", "信阳", "周口", "驻马店", "焦作"],
        "郑州": {"areas": ["巩义市", "中牟县", "金水区", "新密市", "新郑市", "管城回族区", "惠济区", "荥阳市", "二七区", "中原区", "上街区", "登封市"]},
        "开封": {"areas": ["开封县", "金明区", "禹王台区", "龙亭区", "尉氏县", "鼓楼区", "通许县", "兰考县", "杞县", "顺河回族区"]},
        "洛阳": {"areas": ["涧西区", "孟津县", "栾川县", "西工区", "偃师市", "汝阳县", "洛龙区", "洛宁县", "吉利区", "宜阳县", "伊川县", "老城区", "新安县", "嵩县", "瀍河回族区"]},
        "平顶山": {"areas": ["郏县", "舞钢市", "汝州市", "湛河区", "卫东区", "宝丰县", "叶县", "鲁山县", "新华区", "石龙区"]},
        "安阳": {"areas": ["安阳县", "林州市", "文峰区", "北关区", "滑县", "殷都区", "内黄县", "龙安区", "汤阴县"]},
        "鹤壁": {"areas": ["淇县", "鹤山区", "山城区", "浚县", "淇滨区"]},
        "新乡": {"areas": ["长垣县", "封丘县", "卫滨区", "牧野区", "原阳县", "红旗区", "获嘉县", "凤泉区", "新乡县", "辉县市", "延津县", "卫辉市"]},
        "焦作": {"areas": ["济源市"]},
        "濮阳": {"areas": ["范县", "华龙区", "南乐县", "清丰县", "濮阳县", "台前县"]},
        "许昌": {"areas": ["襄城县", "禹州市", "魏都区", "鄢陵县", "许昌县", "长葛市"]},
        "漯河": {"areas": ["郾城区", "舞阳县", "召陵区", "临颍县", "源汇区"]},
        "三门峡": {"areas": ["湖滨区", "���马市", "渑池县", "卢氏县", "陕县", "灵宝市"]},
        "南阳": {"areas": ["淅川县", "宛城区", "新野县", "邓州市", "卧龙区", "内乡县", "西峡县", "方城县", "唐河县", "桐柏县", "南召县", "社旗县", "镇平县"]},
        "商丘": {"areas": ["虞城县", "夏邑县", "睢阳区", "梁园区", "宁陵县", "柘城县", "睢县", "永城市", "民权县"]},
        "信阳": {"areas": ["淮滨县", "新县", "固始县", "光山县", "浉河区", "商城县", "罗山县", "潢川县", "平桥区", "息县"]},
        "周口": {"areas": ["扶沟县", "商水县", "项城市", "沈丘县", "郸城县", "鹿邑县", "淮阳县", "西华县", "太康县", "川汇区"]},
        "驻马店": {"areas": ["汝南县", "确山县", "驿城区", "新蔡县", "平舆县", "正阳县", "遂平县", "泌阳县", "西平县", "上蔡县"]}
    },
    "湖北": {
        "citys": ["武汉", "黄石", "十堰", "荆州", "宜昌", "襄樊", "鄂州", "荆门", "孝感", "黄冈", "咸宁", "随州", "恩施土家族苗族自治州", "仙桃", "天门", "潜江", "神农架林区"],
        "武汉": {"areas": ["东西湖区", "青山区", "洪山区", "汉阳区", "硚口区", "江夏区", "武昌区", "江汉区", "新洲区", "黄陂区", "汉南区", "蔡甸区", "江岸区"]},
        "黄石": {"areas": ["黄石港区", "铁山区", "西塞山区", "阳新县", "大冶市", "下陆区"]},
        "十堰": {"areas": ["竹山县", "郧县", "竹溪县", "丹江口市", "茅箭区", "张湾区", "郧西县", "房县"]},
        "荆州": {"areas": ["监利县", "松滋市", "沙市区", "石首市", "江陵县", "公安县", "荆州区", "洪湖市"]},
        "宜昌": {"areas": ["伍家岗区", "夷陵区", "枝江市", "西陵区", "兴山县", "猇亭区", "五峰土家族自治县", "点军区", "长阳土家族自治县", "秭归县", "宜都市", "远安县", "当阳市"]},
        "襄樊": {"areas": ["宜城市", "谷城县", "老河口市", "樊城区", "襄阳区", "襄城区", "枣阳市", "保康县", "南漳县"]},
        "鄂州": {"areas": ["梁子湖区", "鄂城区", "华容区"]},
        "荆门": {"areas": ["京山县", "沙洋县", "东宝区", "掇刀区", "钟祥市"]},
        "孝感": {"areas": ["大悟县", "安陆市", "应城市", "汉川市", "孝南区", "云梦县", "孝昌县"]},
        "黄冈": {"areas": ["罗田县", "蕲春县", "浠水县", "武穴市", "黄州区", "团风县", "麻城市", "红安县", "英山县", "黄梅县"]},
        "咸宁": {"areas": ["赤壁市", "通山县", "崇阳县", "通城县", "咸安区", "嘉鱼县"]},
        "随州": {"areas": ["曾都区", "广水市"]},
        "恩施土家族苗族自治州": {"areas": ["宣恩县", "恩施市", "咸丰县", "来凤县", "利川市", "鹤峰县", "巴东县", "建始县"]},
        "仙桃": {"areas": ["仙桃"]},
        "天门": {"areas": ["天门"]},
        "潜江": {"areas": ["潜江"]},
        "神农架林区": {"areas": ["神农架林区"]}
    },
    "湖南": {
        "citys": ["长沙", "株洲", "湘潭", "衡阳", "邵阳", "岳阳", "常德", "张家界", "益阳", "郴州", "永州", "怀化", "娄底", "湘西土家族苗族自治州"],
        "长沙": {"areas": ["岳麓区", "长沙县", "雨花区", "芙蓉区", "天心区", "宁乡县", "开福区", "浏阳市", "望城县"]},
        "株洲": {"areas": ["醴陵市", "攸县", "天元区", "石峰区", "荷塘区", "炎陵县", "株洲县", "芦淞区", "茶陵县"]},
        "湘潭": {"areas": ["湘潭县", "韶山市", "岳塘区", "雨湖区", "湘乡市"]},
        "衡阳": {"areas": ["珠晖区", "衡南县", "常宁市", "衡山县", "祁东县", "蒸湘区", "衡阳县", "南岳区", "雁峰区", "石鼓区", "耒阳市", "衡东县"]},
        "邵阳": {"areas": ["武冈市", "洞口县", "双清区", "城步苗族自治县", "邵阳县", "绥宁县", "大祥区", "新邵县", "北塔区", "新宁县", "邵东县", "隆回县"]},
        "岳阳": {"areas": ["华容县", "临湘市", "湘阴县", "岳阳楼区", "君山区", "云溪区", "平江县", "岳阳县", "汨罗市"]},
        "常德": {"areas": ["临澧县", "桃源县", "澧县", "鼎城区", "汉寿县", "津市市", "武陵区", "安乡县", "石门县"]},
        "张家界": {"areas": ["桑植县", "慈利县", "武陵源区", "永定区"]},
        "益阳": {"areas": ["安化县", "赫山区", "沅江市", "南县", "桃江县", "资阳区"]},
        "郴州": {"areas": ["资兴市", "桂东县", "苏仙区", "嘉禾县", "临武县", "安仁县", "北湖区", "永兴县", "宜章县", "汝城县", "桂阳县"]},
        "永州": {"areas": ["冷水滩区", "新田县", "宁远县", "江华瑶族自治县", "东安县", "双牌县", "蓝山县", "祁阳县", "道县", "江永县", "零陵区"]},
        "怀化": {"areas": ["辰溪县", "通道侗族自治县", "麻阳苗族自治县", "芷江侗族自治县", "鹤城区", "靖州苗族侗族自治县", "溆浦县", "会同县", "沅陵县", "洪江市", "新晃侗族自治县", "中方县"]},
        "娄底": {"areas": ["双峰县", "娄星区", "冷水江市", "涟源市", "新化县"]},
        "湘西土家族苗族自治州": {"areas": ["吉首市", "古丈县", "凤凰县", "永顺县", "花垣县", "龙山县", "保靖县", "泸溪县"]}
    },
    "广东": {
        "citys": ["广州", "深圳", "东莞", "中山", "潮州", "揭阳", "云浮", "珠海", "汕头", "韶关", "佛山", "江门", "湛江", "茂名", "肇庆", "惠州", "梅州", "汕尾", "河源", "阳江", "清远"],
        "广州": {"areas": ["白云区", "天河区", "越秀区", "萝岗区", "花都区", "番禺区", "南沙区", "荔湾区", "黄埔区", "海珠区", "增城市", "从化市"]},
        "深圳": {"areas": ["龙岗区", "南山区", "盐田区", "福田区", "宝安区", "罗湖区"]},
        "东莞": {"areas": ["莞城", "常平", "塘厦"]},
        "中山": {"areas": ["中山"]},
        "潮州": {"areas": ["潮安县", "湘桥区", "饶平县"]},
        "揭阳": {"areas": ["普宁市", "榕城区", "揭西县", "惠来县", "揭东县"]},
        "云浮": {"areas": ["郁南县", "云城区", "云安县", "罗定市", "新兴县"]},
        "珠海": {"areas": ["斗门区", "金湾区", "香洲区"]},
        "汕头": {"areas": ["潮南区", "龙湖区", "南澳县", "澄海区", "濠江区", "金平区", "潮阳区"]},
        "韶关": {"areas": ["翁源县", "曲江区", "浈江区", "始兴县", "仁化县", "乐昌市", "南雄市", "新丰县", "武江区", "乳源瑶族自治县"]},
        "佛山": {"areas": ["三水区", "南海区", "高明区", "顺德区", "禅城区"]},
        "江门": {"areas": ["鹤山市", "蓬江区", "新会区", "开平市", "恩平市", "台山市", "江海区"]},
        "湛江": {"areas": ["廉江市", "雷州市", "麻章区", "吴川市", "赤坎区", "霞山区", "徐闻县", "坡头区", "遂溪县"]},
        "茂名": {"areas": ["化州市", "电白县", "茂南区", "高州市", "信宜市", "茂港区"]},
        "肇庆": {"areas": ["封开县", "怀集县", "德庆县", "广宁县", "端州区", "四会市", "高要市", "鼎湖区"]},
        "惠州": {"areas": ["龙门县", "惠城区", "惠东县", "博罗县", "惠阳区"]},
        "梅州": {"areas": ["五华县", "丰顺县", "梅江区", "蕉岭县", "大埔县", "平远县", "兴宁市", "梅县"]},
        "汕尾": {"areas": ["陆丰市", "海丰县", "陆河县", "城区"]},
        "河源": {"areas": ["和平县", "龙川县", "东源县", "连平县", "源城区", "紫金县"]},
        "阳江": {"areas": ["阳东县", "阳春市", "江城区", "阳西县"]},
        "清远": {"areas": ["连州市", "清城区", "佛冈县", "连山壮族瑶族自治县", "连南瑶族自治县", "阳山县", "清新县", "英德市"]}
    },
    "广西": {
        "citys": ["南宁", "柳州", "桂林", "梧州", "北海", "防城港", "钦州", "贵港", "玉林", "百色", "贺州", "河池", "来宾", "崇左"],
        "南宁": {"areas": ["武鸣县", "江南区", "马山县", "兴宁区", "横县", "青秀区", "西乡塘区", "邕宁区", "良庆区", "宾阳县", "上林县", "隆安县"]},
        "柳州": {"areas": ["鹿寨县", "融安县", "柳南区", "三江侗族自治县", "鱼峰区", "柳北区", "柳城县", "城中区", "柳江县", "融水苗族自治县"]},
        "桂林": {"areas": ["平乐县", "象山区", "灵川县", "龙胜各族自治县", "叠彩区", "永福县", "全州县", "秀峰区", "兴安县", "资源县", "阳朔县", "荔浦县", "雁山区", "临桂县", "灌阳县", "恭城瑶族自治县", "七星区"]},
        "梧州": {"areas": ["蒙山县", "藤县", "岑溪市", "蝶山区", "苍梧县", "万秀区", "长洲区"]},
        "北海": {"areas": ["铁山港区", "银海区", "海城区", "合浦县"]},
        "防城港": {"areas": ["东兴市", "港口区", "上思县", "防城区"]},
        "钦州": {"areas": ["灵山县", "钦北区", "钦南区", "浦北县"]},
        "贵港": {"areas": ["覃塘区", "港北区", "港南区", "平南县", "桂平市"]},
        "玉林": {"areas": ["���州区", "博白县", "陆川县", "北流市", "兴业县", "容县"]},
        "百色": {"areas": ["西林县", "平果县", "田林县", "右江区", "德保县", "隆林各族自治县", "乐业县", "田阳县", "凌云县", "靖西县", "田东县", "那坡县"]},
        "贺州": {"areas": ["富川瑶族自治县", "昭平县", "钟山县", "八步区"]},
        "河池": {"areas": ["南丹县", "罗城仫佬族自治县", "凤山县", "宜州市", "东兰县", "金城江区", "环江毛南族自治县", "大化瑶族自治县", "天峨县", "巴马瑶族自治县", "都安瑶族自治县"]},
        "来宾": {"areas": ["武宣县", "合山市", "忻城县", "兴宾区", "金秀瑶族自治县", "象州县"]},
        "崇左": {"areas": ["扶绥县", "宁明县", "江州区", "大新县", "龙州县", "天等县", "凭祥市"]}
    },
    "海南": {
        "citys": ["海口", "三亚", "五指山", "琼海", "儋州", "文昌", "万宁", "东方", "澄迈县", "定安县", "屯昌县", "临高县", "白沙黎族自治县", "昌江黎族自治县", "乐东黎族自治县", "陵水黎族自治县", "保亭黎族苗族自治县", "琼中黎族苗族自治县"],
        "海口": {"areas": ["龙华区", "美兰区", "琼山区", "秀英区"]},
        "三亚": {"areas": ["三亚市"]},
        "五指山": {"areas": ["五指山"]},
        "琼海": {"areas": ["琼海"]},
        "儋州": {"areas": ["儋州"]},
        "文昌": {"areas": ["文昌"]},
        "万宁": {"areas": ["万宁"]},
        "东方": {"areas": ["东方"]},
        "澄迈县": {"areas": ["澄迈县"]},
        "定安县": {"areas": ["定安县"]},
        "屯昌县": {"areas": ["屯昌县"]},
        "临高县": {"areas": ["临高县"]},
        "白沙黎族自治县": {"areas": ["白沙黎族自治县"]},
        "昌江黎族自治县": {"areas": ["昌江黎族自治县"]},
        "乐东黎族自治县": {"areas": ["乐东黎族自治县"]},
        "陵水黎族自治县": {"areas": ["陵水黎族自治县"]},
        "保亭黎族苗族自治县": {"areas": ["保亭黎族苗族自治县"]},
        "琼中黎族苗族自治县": {"areas": ["琼中黎族苗族自治县"]}
    },
    "重庆": {
        "citys": ["重庆"],
        "重庆": {"areas": ["綦江县", "南岸区", "丰都县", "大渡口区", "渝中区", "垫江县", "秀山土家族苗族自治县", "长寿区", "云阳县", "涪陵区", "潼南县", "沙坪坝区", "忠县", "梁平县", "铜梁县", "渝北区", "永川区", "北碚区", "酉阳土家族苗族自治县", "南川区", "巫山县", "万州区", "荣昌县", "江北区", "石柱土家族自治县", "合川区", "黔江区", "江津区", "大足县", "开县", "璧山县", "彭水苗族土家族自治县", "巴南区", "武隆县", "九龙坡区", "万盛区", "双桥区", "巫溪县", "城口县", "奉节县"]}
    },
    "四川": {
        "citys": ["成都", "自贡", "攀枝花", "泸州", "德阳", "绵阳", "广元", "遂宁", "内江", "乐山", "南充", "眉山", "宜宾", "广安", "达州", "雅安", "巴中", "资阳", "阿坝藏族羌族自治州", "甘孜藏族自治州", "凉山彝族自治州"],
        "成都": {"areas": ["邛崃市", "龙泉驿区", "锦江区", "金牛区", "大邑县", "崇州市", "成华区", "新都区", "蒲江县", "青白江区", "双流县", "都江堰市", "温江区", "金堂县", "新津县", "武侯区", "青羊区", "彭州市", "郫县"]},
        "自贡": {"areas": ["贡井区", "沿滩区", "大安区", "富顺县", "自流井区", "荣县"]},
        "攀枝花": {"areas": ["西区", "东区", "米易县", "仁和区", "盐边县"]},
        "泸州": {"areas": ["叙永县", "江阳区", "古蔺县", "纳溪区", "合江县", "泸县", "龙马潭区"]},
        "德阳": {"areas": ["罗江县", "旌阳区", "绵竹市", "广汉市", "中江县", "什邡市"]},
        "绵阳": {"areas": ["涪城区", "游仙区", "北川羌族自治县", "三台县", "盐亭县", "安县", "江油市", "平武县", "梓潼县"]},
        "广元": {"areas": ["市中区", "青川县", "朝天区", "苍溪县", "旺苍县", "剑阁县", "元坝区"]},
        "遂宁": {"areas": ["大英县", "蓬溪县", "安居区", "射洪县", "船山区"]},
        "内江": {"areas": ["威远县", "市中区", "资中县", "东兴区", "隆昌县"]},
        "乐山": {"areas": ["犍为县", "夹江县", "金口河区", "马边彝族自治县", "五通桥区", "沙湾区", "市中区", "峨边彝族自治县", "峨眉山市", "井研县", "沐川县"]},
        "南充": {"areas": ["仪陇县", "顺庆区", "阆中市", "西充县", "高坪区", "南部县", "营山县", "嘉陵区", "蓬安县"]},
        "眉山": {"areas": ["东坡区", "丹棱县", "彭山县", "仁寿县", "青神县", "洪雅县"]},
        "宜宾": {"areas": ["翠屏区", "江安县", "兴文县", "屏山县", "高县", "筠连县", "长宁县", "宜宾县", "珙县", "南溪县"]},
        "广安": {"areas": ["武胜县", "华蓥市", "邻水县", "岳池县", "广安区"]},
        "达州": {"areas": ["渠县", "达县", "大竹县", "通川区", "开江县", "宣汉县", "万源市"]},
        "雅安": {"areas": ["名山县", "宝兴县", "芦山县", "荥经县", "天全县", "汉源县", "石棉县", "雨城区"]},
        "巴中": {"areas": ["巴州区", "平昌县", "通江县", "南江县"]},
        "资阳": {"areas": ["简阳市", "雁江区", "乐至县", "安岳县"]},
        "阿坝藏族羌族自治州": {"areas": ["理县", "小金县", "若尔盖县", "壤塘县", "金川县", "红原县", "九寨沟县", "阿坝县", "松潘县", "马尔康县", "黑水县", "茂县", "汶川县"]},
        "甘孜藏族自治州": {"areas": ["雅江县", "道孚县", "九龙县", "色达县", "炉霍县", "石渠县", "乡城县", "新龙县", "甘孜县", "康定县", "泸定县", "白玉县", "稻城县", "得荣县", "巴塘县", "丹巴县", "理塘县", "德格县"]},
        "凉山彝族自治州": {"areas": ["喜德县", "雷波县", "宁南县", "甘洛县", "金阳县", "布拖县", "德昌县", "西昌市", "越西县", "昭觉县", "冕宁县", "会东县", "木里藏族自治县", "美姑县", "盐源县", "会理县", "普格县"]}
    },
    "贵州": {
        "citys": ["贵阳", "六盘水", "遵义", "安顺", "铜仁地区", "毕节地区", "黔西南布依族苗族自治州", "黔东南苗族侗族自治州", "黔南布依族苗族自治州"],
        "贵阳": {"areas": ["修文县", "开阳县", "白云区", "南明区", "小河区", "花溪区", "清镇市", "息烽县", "云岩区", "乌当区"]},
        "六盘水": {"areas": ["水城县", "六枝特区", "盘县", "钟山区"]},
        "遵义": {"areas": ["汇川区", "习水县", "红花岗区", "道真仡佬族苗族自治县", "正安县", "绥阳县", "凤冈县", "赤水市", "务川仡佬族苗族自治县", "桐梓县", "余庆县", "湄潭县", "遵义县", "仁怀市"]},
        "安顺": {"areas": ["西秀区", "镇宁布依族苗族自治县", "紫云苗族布依族自治县", "平坝县", "普定县", "关岭布依族苗族自治县"]},
        "铜仁地区": {"areas": ["松桃苗族自治县", "玉屏侗族自治县", "沿河土家族自治县", "石阡县", "德江县", "印江土家族苗族自治县", "铜仁市", "思南县", "江口县", "万山特区"]},
        "毕节地区": {"areas": ["黔西县", "威宁彝族回族苗族自治县", "金沙县", "大方县", "赫章县", "织金县", "毕节市", "纳雍县"]},
        "黔西南布依族苗族自治州": {"areas": ["普安县", "册亨县", "晴隆县", "贞丰县", "安龙县", "望谟县", "兴义市", "兴仁县"]},
        "黔东南苗族侗族自治州": {"areas": ["黄平县", "雷山县", "天柱县", "锦屏县", "施秉县", "剑河县", "榕江县", "麻江县", "丹寨县", "岑巩县", "三穗县", "台江县", "凯里市", "镇远县", "黎平县", "从江县"]},
        "黔南布依族苗族自治州": {"areas": ["龙里县", "荔波县", "都匀市", "瓮安县", "福泉市", "贵定县", "独山县", "惠水县", "三都水族自治县", "罗甸县", "平塘县", "长顺县"]}
    },
    "云南": {
        "citys": ["昆明", "曲靖", "玉溪", "保山", "昭通", "丽江", "普洱", "临沧", "德宏傣族景颇族自治州", "怒江傈僳族自治州", "迪庆藏族自治州", "大理白族自治州", "楚雄彝族自治州", "红河哈尼族彝族自治州", "文山壮族苗族自治州", "西双版纳傣族自治州"],
        "昆明": {"areas": ["寻甸回族彝族自治县", "石林彝族自治县", "呈贡县", "晋宁县", "官渡区", "禄劝彝族苗族自治县", "嵩明县", "东川区", "西山区", "五华区", "富民县", "盘龙区", "宜良县", "安宁市"]},
        "曲靖": {"areas": ["会泽县", "罗平县", "师宗县", "富源县", "沾益县", "宣威市", "麒麟区", "马龙县", "陆良县"]},
        "玉溪": {"areas": ["元江哈尼族彝族傣族自治县", "新平彝族傣族自治县", "峨山彝族自治县", "通海县", "澄江县", "易门县", "江川县", "红塔区", "华宁县"]},
        "保山": {"areas": ["隆阳区", "腾冲县", "龙陵县", "昌宁县", "施甸县"]},
        "昭通": {"areas": ["威信县", "鲁甸县", "巧家县", "水富县", "镇雄县", "昭阳区", "绥江县", "大关县", "盐津县", "永善县", "彝良县"]},
        "丽江": {"areas": ["宁蒗彝族自治县", "玉龙纳西族自治县", "华坪县", "永胜县", "古城区"]},
        "普洱": {"areas": ["普洱哈尼族彝族自治县", "景东彝族自治县", "孟连傣族拉祜族佤族自治县", "澜沧拉祜族自治县", "思茅区", "江城哈尼族彝族自治县", "西盟佤族自治县", "墨江哈尼族自治县", "景谷傣族彝族自治县", "镇沅彝族哈尼族拉祜族自治县"]},
        "临沧": {"areas": ["云县", "沧源佤族自治县", "临翔区", "凤庆县", "耿马傣族佤族自治县", "镇康县", "双江拉祜族佤族布朗族傣族自治县", "永德县"]},
        "德宏傣族景颇族自治州": {"areas": ["陇川县", "梁河县", "盈江县", "瑞丽市", "潞西市"]},
        "怒江傈僳族自治州": {"areas": ["福贡县", "泸水县", "兰坪白族普米族自治县", "贡山独龙族怒族自治县"]},
        "迪庆藏族自治州": {"areas": ["香格里拉县", "维西傈僳族自治县", "德钦县"]},
        "大理白族自治州": {"areas": ["宾川县", "巍山彝族回族自治县", "大理市", "弥渡县", "祥云县", "云龙县", "漾濞彝族自治县", "洱源县", "南涧彝族自治县", "剑川县", "鹤庆县", "永平县"]},
        "楚雄彝族自治州": {"areas": ["双柏县", "元谋县", "大姚县", "南华县", "武定县", "禄丰县", "永仁县", "楚雄市", "姚安县", "牟定县"]},
        "红河哈尼族彝族自治州": {"areas": ["蒙自县", "建水县", "泸西县", "元阳县", "河口瑶族自治县", "石屏县", "金平苗族瑶族傣族自治县", "红河县", "开远市", "弥勒县", "个旧市", "屏边苗族自治县", "绿春县"]},
        "文山壮族苗族自治州": {"areas": ["文山县", "马关县", "西畴县", "丘北县", "广南县", "富宁县", "砚山县", "麻栗坡县"]},
        "西双版纳傣族自治州": {"areas": ["勐腊县", "景洪市", "勐海县"]}
    },
    "西藏": {
        "citys": ["拉萨", "那曲地区", "昌都地区", "林芝地区", "山南地区", "日喀则地区", "阿里地区"],
        "拉萨": {"areas": ["堆龙德庆县", "曲水县", "尼木县", "林周县", "当雄县", "达孜县", "墨竹工卡县", "城关区"]},
        "那曲地区": {"areas": ["安多县", "嘉黎县", "尼玛县", "索县", "班戈县", "申扎县", "巴青县", "聂荣县", "比如县", "那曲县"]},
        "昌都地区": {"areas": ["察雅县", "丁青县", "芒康县", "洛隆县", "江达县", "贡觉县", "八宿县", "昌都县", "左贡县", "边坝县", "类乌齐县"]},
        "林芝地区": {"areas": ["工布江达县", "朗县", "察隅县", "墨脱县", "林芝县", "波密县", "米林县"]},
        "山南地区": {"areas": ["曲松县", "扎囊县", "加查县", "乃东县", "措美县", "隆子县", "洛扎县", "琼结县", "贡嘎县", "浪卡子县", "桑日县", "错那县"]},
        "日喀则地区": {"areas": ["谢通门县", "仲巴县", "白朗县", "南木林县", "江孜县", "萨迦县", "昂仁县", "聂拉木县", "亚东县", "定结县", "萨嘎县", "吉隆县", "拉孜县", "定日县", "仁布县", "日喀则市", "康马县", "岗巴县"]},
        "阿里地区": {"areas": ["普兰县", "措勤县", "改则县", "噶尔县", "札达县", "日土县", "革吉县"]}
    },
    "陕西": {
        "citys": ["西安", "铜川", "宝鸡", "咸阳", "渭南", "延安", "汉中", "榆林", "安康", "商洛"],
        "西安": {"areas": ["碑林区", "新城区", "长安区", "蓝田县", "灞桥区", "高陵县", "莲湖区", "周至县", "阎良区", "雁塔区", "未央区", "临潼区", "户县"]},
        "铜川": {"areas": ["宜君县", "耀州区", "印台区", "王益区"]},
        "宝鸡": {"areas": ["凤县", "渭滨区", "千阳县", "岐山县", "陇县", "陈仓区", "麟游县", "扶风县", "眉县", "凤翔县", "金台区", "太白县"]},
        "咸阳": {"areas": ["长武县", "泾阳县", "三原县", "杨陵区", "乾县", "彬县", "淳化县", "旬邑县", "礼泉县", "渭城区", "武功县", "兴平市", "秦都区", "永寿县"]},
        "渭南": {"areas": ["韩城市", "合阳县", "大荔县", "蒲城县", "华县", "澄城县", "华阴市", "临渭区", "白水县", "潼关县", "富平县"]},
        "延安": {"areas": ["安塞县", "富县", "洛川县", "延长县", "黄陵县", "志丹县", "宝塔区", "子长县", "黄龙县", "宜川县", "延川县", "吴起县", "甘泉县"]},
        "汉中": {"areas": ["佛坪县", "留坝县", "略阳县", "宁强县", "镇巴县", "洋县", "西乡县", "勉县", "城固县", "汉台区", "南郑县"]},
        "榆林": {"areas": ["神木县", "佳县", "吴堡县", "府谷县", "绥德县", "清涧县", "定边县", "子洲县", "横山县", "米脂县", "靖边县", "榆阳区"]},
        "安康": {"areas": ["汉阴县", "汉滨区", "平利县", "岚皋县", "白河县", "宁陕县", "紫阳县", "石泉县", "镇坪县", "旬阳县"]},
        "商洛": {"areas": ["柞水县", "商州区", "山阳县", "镇安县", "丹凤县", "商南县", "洛南县"]}
    },
    "甘肃": {
        "citys": ["兰州", "嘉峪关", "金昌", "白银", "天水", "武威", "酒泉", "张掖", "庆阳", "平凉", "定西", "陇南", "临夏回族自治州", "甘南藏族自治州"],
        "兰州": {"areas": ["皋兰县", "榆中县", "永登县", "城关区", "红古区", "安宁区", "西固区", "七里河区"]},
        "嘉峪关": {"areas": ["嘉峪关市"]},
        "金昌": {"areas": ["永昌县", "金川区"]},
        "白银": {"areas": ["会宁县", "景泰县", "白银区", "靖远县", "平川区"]},
        "天水": {"areas": ["北道区", "甘谷县", "秦安县", "张家川回族自治县", "秦城区", "武山县", "清水县"]},
        "武威": {"areas": ["民勤县", "古浪县", "凉州区", "天祝藏族自治县"]},
        "酒泉": {"areas": ["金塔县", "肃北蒙古族自治县", "敦煌市", "玉门市", "阿克塞哈萨克族自治县", "安西县", "肃州区"]},
        "张掖": {"areas": ["民乐县", "临泽县", "山丹县", "高台县", "甘州区", "肃南裕固族自治县"]},
        "庆阳": {"areas": ["镇原县", "正宁县", "合水县", "华池县", "西峰区", "宁县", "环县", "庆城县"]},
        "平凉": {"areas": ["静宁县", "崇信县", "泾川县", "华亭县", "灵台县", "庄浪县", "崆峒区"]},
        "定西": {"areas": ["渭源县", "临洮县", "岷县", "通渭县", "陇西县", "安定区", "漳县"]},
        "陇南": {"areas": ["礼县", "西和县", "宕昌县", "两当县", "成县", "徽县", "武都区", "文县", "康县"]},
        "临夏回族自治州": {"areas": ["东乡族自治县", "康乐县", "临夏市", "永靖县", "广河县", "积石山保安族东乡族撒拉族自治县", "和政县", "临夏县"]},
        "甘南藏族自治州": {"areas": ["碌曲县", "舟曲县", "夏河县", "合作市", "玛曲县", "卓尼县", "迭部县", "临潭县"]}
    },
    "青海": {
        "citys": ["西宁", "海东地区", "海北藏族自治州", "海南藏族自治州", "黄南藏族自治州", "果洛藏族自治州", "玉树藏族自治州", "海西蒙古族藏族自治州"],
        "西宁": {"areas": ["城东区", "城中区", "湟源县", "城西区", "大通回族土族自治县", "湟中县", "城北区"]},
        "海东地区": {"areas": ["乐都县", "循化撒拉族自治县", "民和回族土族自治县", "平安县", "互助土族自治县", "化隆回族自治县"]},
        "海北藏族自治州": {"areas": ["祁连县", "海晏县", "刚察县", "门源回族自治县"]},
        "海南藏族自治州": {"areas": ["同德县", "贵南县", "共和县", "贵德县", "兴海县"]},
        "黄南藏族自治州": {"areas": ["同仁县", "尖扎县", "河南蒙古族自治县", "泽库县"]},
        "果洛藏族自治州": {"areas": ["班玛县", "达日县", "甘德县", "玛多县", "久治县", "玛沁县"]},
        "玉树藏族自治州": {"areas": ["曲麻莱县", "称多县", "杂多县", "玉树县", "治多县", "囊谦县"]},
        "海西蒙古族藏族自治州": {"areas": ["都兰县", "乌兰县", "格尔木市", "天峻县", "德令哈市"]}
    },
    "宁夏": {
        "citys": ["银川", "石嘴山", "吴忠", "固原", "中卫"],
        "银川": {"areas": ["灵武市", "贺兰县", "永宁县", "兴庆区", "金凤区", "西夏区"]},
        "石嘴山": {"areas": ["惠农区", "大武口区", "平罗县"]},
        "吴忠": {"areas": ["利通区", "青铜峡市", "同心县", "盐池县"]},
        "固原": {"areas": ["隆德县", "泾源县", "原州区", "彭阳县", "西吉县"]},
        "中卫": {"areas": ["沙坡头区", "海原县", "中宁县"]}
    },
    "新疆": {
        "citys": ["乌鲁木齐", "克拉玛依", "吐鲁番地区", "哈���地区", "和田地区", "阿克苏地区", "喀什地区", "克孜勒苏柯尔克孜自治州", "巴音郭楞蒙古自治州", "昌吉回族自治州", "博尔塔拉蒙古自治州", "石河子", "阿拉尔", "图木舒克", "五家渠", "伊犁哈萨克自治州"],
        "乌鲁木齐": {"areas": ["乌鲁木齐县", "头屯河区", "达坂城区", "东山区", "水磨沟区", "沙依巴克区", "天山区", "新市区"]},
        "克拉玛依": {"areas": ["独山子区", "白碱滩区", "乌尔禾区", "克拉玛依区"]},
        "吐鲁番地区": {"areas": ["吐鲁番市", "鄯善县", "托克逊县"]},
        "哈密地区": {"areas": ["哈密市", "巴里坤哈萨克自治县", "伊吾县"]},
        "和田地区": {"areas": ["洛浦县", "于田县", "策勒县", "和田市", "墨玉县", "皮山县", "民丰县", "和田县"]},
        "阿克苏地区": {"areas": ["库车县", "阿克苏市", "柯坪县", "阿瓦提县", "沙雅县", "新和县", "拜城县", "温宿县", "乌什县"]},
        "喀什地区": {"areas": ["英吉沙县", "泽普县", "塔什库尔干塔吉克自治县", "疏附县", "伽师县", "岳普湖县", "疏勒县", "莎车县", "麦盖提县", "叶城县", "巴楚县", "喀什市"]},
        "克孜勒苏柯尔克孜自治州": {"areas": ["阿合奇县", "阿克陶县", "阿图什市", "乌恰县"]},
        "巴音郭楞蒙古自治州": {"areas": ["和静县", "尉犁县", "焉耆回族自治县", "轮台县", "库尔勒市", "若羌县", "博湖县", "且末县", "和硕县"]},
        "昌吉回族自治州": {"areas": ["呼图壁县", "吉木萨尔县", "昌吉市", "奇台县", "阜康市", "米泉市", "玛纳斯县", "木垒哈萨克自治县"]},
        "博尔塔拉蒙古自治州": {"areas": ["博乐市", "温泉县", "精河县"]},
        "石河子": {"areas": ["石河子"]},
        "阿拉尔": {"areas": ["阿拉尔"]},
        "图木舒克": {"areas": ["图木舒克"]},
        "五家渠": {"areas": ["五家渠"]},
        "伊犁哈萨克自治州": {"areas": ["霍城县", "新源县", "奎屯市", "特克斯县", "昭苏县", "阿勒泰地区", "伊宁市", "尼勒克县", "伊宁县", "察布查尔锡伯自治县", "塔城地区", "巩留县"]}
    },
    "台湾": {
        "citys": ["台湾"],
        "台湾": {"areas": ["台中市", "南投县", "高雄市", "台南市", "台南县", "屏东县", "新竹市", "宜兰县", "基隆市", "澎湖县", "彰化县", "台北县", "苗栗县", "嘉义县", "云林县", "嘉义市", "台北市", "花莲县", "台中县", "桃园县", "高雄县", "新竹县", "台东县"]}
    },
    "澳门": {"citys": ["澳门"], "澳门": {"areas": ["路凼", "圣方济各堂区", "嘉模堂区", "望德堂区", "大堂区", "风顺堂区", "圣安多尼堂区", "花地玛堂区"]}},
    "香港": {
        "citys": ["香港"],
        "香港": {"areas": ["深水埗区", "油尖旺区", "中西区", "湾仔区", "荃湾区", "西贡区", "南区", "沙田区", "大埔区", "九龙城区", "观塘区", "黄大仙区", "葵青区", "离岛区", "元朗区", "屯门区", "东区", "北区"]}
    }
};
app.register.directive("chinaAreaSelector", ["$templateCache", function () {
    return {
        restrict: "E",
        templateUrl: "views/template/china-area-selector.html",
        replcae: !0,
        scope: {region: "="},
        link: function (a, e) {
            var r = e.children().eq(1), s = e.children().eq(2);
            a.provinces = __areaData__.provinces || [];
            var n = function (a) {
                return (__areaData__[a] || {}).citys || []
            }, i = function (a, e) {
                var r = (__areaData__[a] || {})[e];
                return (r || {}).areas || []
            }, t = function (a, e) {
                for (var r in a)if (a[r] === e)return r;
                return -1
            }, c = function (e) {
                var r = angular.copy(e || {});
                if (-1 === t(a.provinces, r.province))return r.province = r.city = r.area = "", r;
                var s = n(r.province);
                if (-1 === t(s, r.city))return r.city = r.area = "", r;
                var c = i(r.province, r.city);
                return -1 === t(c, r.area) ? (r.area = "", r) : r
            }, o = function (e) {
                a.region = c(e), a.citys = n(a.region.province), a.areas = i(a.region.province, a.region.city), setTimeout(function () {
                    var e = t(a.citys, a.region.city);
                    r.val(e > -1 ? e : "");
                    var n = t(a.areas, a.region.area);
                    s.val(n > -1 ? n : "")
                })
            };
            a.$watch("region", o, !0)
        }
    }
}]);
app.register.directive("twoAreaSelector", ["$templateCache", function () {
    return {
        restrict: "E",
        templateUrl: "views/template/two-area-selector.html",
        replcae: !0,
        scope: {region: "="},
        link: function (a, e) {
            var r = e.children().eq(1), s = e.children().eq(2);
            a.provinces = __areaData__.provinces || [];
            var n = function (a) {
                return (__areaData__[a] || {}).citys || []
            }, i = function (a, e) {
                var r = (__areaData__[a] || {})[e];
                return (r || {}).areas || []
            }, t = function (a, e) {
                for (var r in a)if (a[r] === e)return r;
                return -1
            }, c = function (e) {
                var r = angular.copy(e || {});
                if (-1 === t(a.provinces, r.province))return r.province = r.city = r.area = "", r;
                var s = n(r.province);
                if (-1 === t(s, r.city))return r.city = r.area = "", r;
                var c = i(r.province, r.city);
                return -1 === t(c, r.area) ? (r.area = "", r) : r
            }, o = function (e) {
                if(a.region.province == '' && a.region.city != ''){
                    for(var provinceName in __areaData__){
                        if(__areaData__[provinceName].citys){
                            if(__areaData__[provinceName].citys.toString().indexOf(a.region.city) != -1){
                                a.region.province = provinceName;
                                return;
                            }
                        }
                    }
                }
                a.region = c(e), a.citys = n(a.region.province), a.areas = i(a.region.province, a.region.city), setTimeout(function () {
                    var e = t(a.citys, a.region.city);
                    r.val(e > -1 ? e : "");
                    var n = t(a.areas, a.region.area);
                    s.val(n > -1 ? n : "")
                })
            };
            a.$watch("region", o, !0)
        }
    }
}]);
app.register.directive("chinaAreaSelectorWithWrapper", ["$templateCache", function () {
    return {
        restrict: "E",
        templateUrl: "views/template/china-area-selector-with-wrapper.html",
        replcae: !0,
        scope: {region: "="},
        link: function (a, e) {
            var r = angular.element(e[0]), s = angular.element(r.find("select")[1]), n = angular.element(r.find("select")[2]), i = {
                province: "请选择省",
                city: "请选择市",
                area: "请选择市/区/县"
            };
            a.show = i, a.provinces = __areaData__.provinces || [];
            var t = function (a) {
                return (__areaData__[a] || {}).citys || []
            }, c = function (a, e) {
                var r = (__areaData__[a] || {})[e];
                return (r || {}).areas || []
            }, o = function (a, e) {
                for (var r in a)if (a[r] === e)return r;
                return -1
            }, p = function (e) {
                var r = angular.copy(e || {});
                if (-1 === o(a.provinces, r.province))return r.province = r.city = r.area = "", r;
                var s = t(r.province);
                if (-1 === o(s, r.city))return r.city = r.area = "", r;
                var n = c(r.province, r.city);
                return -1 === o(n, r.area) ? (r.area = "", r) : r
            }, l = function (e) {
                a.show = {
                    province: "" != e.province ? e.province : i.province,
                    city: "" != e.city ? e.city : i.city,
                    area: "" != e.area ? e.area : i.area
                }
            }, v = function (e) {
                a.region = p(e), a.citys = t(a.region.province), a.areas = c(a.region.province, a.region.city), l(e), setTimeout(function () {
                    var e = o(a.citys, a.region.city);
                    s.val(e > -1 ? e : "");
                    var r = o(a.areas, a.region.area);
                    n.val(r > -1 ? r : "")
                })
            };
            a.$watch("region", v, !0)
        }
    }
}]);
angular.module("__chinaAreaSelectorTemplates__", []).run(["$templateCache", function (a) {
    a.put("china-area-selector-with-wrapper.html", '<div class="china-area-selector-wrapper">\n    <span ng-bind="show.province">请选择省市</span>\n    <select name="province" ng-options="province for province in provinces" ng-model="region.province">\n        <option value="">-- 选择省 --</option>\n    </select>\n    <span class="china-area-selector-icon">\n                            <span>\n\n                            </span>\n    </span>\n</div>\n\n<div class="china-area-selector-wrapper">\n    <span ng-bind="show.city">请选择市</span>\n    <select name="city" ng-options="city for city in citys" ng-model="region.city">\n        <option value="">-- 选择市 --</option>\n    </select>\n   <span class="china-area-selector-icon">\n                            <span>\n\n                            </span>\n   </span>\n</div>\n\n<div class="china-area-selector-wrapper">\n    <span ng-bind="show.area">请选择市/区/县</span>\n    <select name="area" ng-options="area for area in areas" ng-model="region.area">\n        <option value="">-- 选择市/区/县 --</option>\n    </select>\n   <span class="china-area-selector-icon">\n                            <span>\n\n                            </span>\n   </span>\n</div>\n\n\n\n\n'), a.put("china-area-selector.html", '\n<select name="province" ng-options="province for province in provinces" ng-model="region.province">\n    <option value="">-- 选择省 --</option>\n</select>\n<select name="city" ng-options="city for city in citys" ng-model="region.city">\n    <option value="">-- 选择市 --</option>\n</select>\n<select name="area" ng-options="area for area in areas" ng-model="region.area">\n    <option value="">-- 选择市/区/县 --</option>\n</select>\n')
}]);